 

 // আমরা আজকে কথা বলব ফান্সন আর আলচনা করবো
 // ফান্সন কি ?
 //ফান্সন মলত ৩ দোরোন এর হই 
 // ইনপুট আউটপুট অ্যান্ড প্রচেসসিং
 /*
 ফান্সন এর ২ জন উজার থাকে একজন ফান্সন বানাই আর একজন কল করে
 আর এই ২ জন হলাম আমি কিন্তু এমন ও হতে পারে আপনে ফান্সন ==== কর্সেন কিন্তু আপনে ইউজ করেন না
 যেমন  টা থার্দ পার্টি লাইব্রেরী এর ভেতরে হই এ থাকে|
আমরা জাভাস্ক্রিপ্ট এ অনেক কোড করেসি কিন্তু এই গুলা কেউ না কেউ তুইরে করেচে এবং আমরা জানি না এই গুলা কেমনে
কাজ করে কিন্তু আমরা কল করলে কাজ করে তাহলে ফান্সন এর ২ টা কাজ থাকে হই একটা ইনপুট দেবো আর ও আমাদের কে আউটপুট দিবে
এবং আমাদের ফান্সন এর ভেতরে কাজ করে processing এই টার কাজ আমরা দেকিনা এই টার কাজ 

প্রোগ্রমি এর ভাসা ফান্সন কী ?
প্রোগ্রমি এর ভাসা ফান্সন  হইছে এক টা কোড ব্লক যে ব্লক এর ভেতর আমাদের কিছু কোড থাকবে |এবং এই কোড এর বিতরে
 থাকে ডেটা ইনপুট দিতে পারবো বাইরে থাকে| এবং অনেক গুলো আরের মান কে সে  এক সাথে + করতে পারে  এবং - ও করতে পারবো
ফান্সন ডিক্লেয়ার করার নিওম| প্র্থম ফান্সন লিক্তে হবে  এর পরে একটা নাম দিতে হবে যেমন 
 */
// function name (){

// }
//এই ভাবে আমার ফান্সন ডিক্লের করবোঁ এর পর এর বেতরে আমরা ফান্সন এর মান দিবো ভেরিএবল ডিক্লেয়ার করবো
function name (){
    var Number = 20
    var Number1 = 10;
    //এবারে আমরা কন্স্ল লগ করবোঁ
     console.log(Number + Number1)
}
// এখানে আমরা ফান্সন কে কল করা হইছে আমরা যদি কল না করে সুদু কন্স্ল লগ করি তাহলে কোনো আউটপুট আসবে না
// তাই কন্সল লগ করার পরে বডি এর নিচে ফান্সন কল করতে হবে এবং এই ফান্সন যত বার কল  করবেন ততো বার আউটপুট 
//পাবেন যামন
name()
//আউটপুট : 30
//আউটপুট : 30
//আবার আমরা আর একটা ফান্সন ডিক্লের করবো ;
function Number (){
    var a = 50
    var b = 30;
    console.log(a - b)
}
Number()
//আউটপুট:20

/*
আমরা ফান্সন কে বার  বার কল না করে অন্য বাবে অনেক বার আউটপুট পেতে পারে লুপ কন্ডিশন ব্যহার করতে পারি
যেমন উধদাহারন 
*/
function jack (){
    console.log("i am function coll for loops")
}
for (var i = 0; i < 10;i++){
   jack()
}
/*
আমরা এবার arguments ফান্সন এর ব্যবহার দ্যাখাব
arguments কী ? arguments হোল

*/
function parameter2 (a,b){
                //parameter
    var sum3 = a+b;
   console.log(sum3)
}

parameter2(10,33)
        // arguments

 function Number (){
    sum =  0;
    for(var o = 0; o<arguments.length; o++){
        sum += arguments[i]
    }
    console.log(sum)
 }
 Number(1,23,4,2)


 
var arr = [1,3,4,5]
var arr1 = [3,3]
var arr2 = [20,30]

// var sum = 0
function add (arr ,arr2){
    var sum = 0   
    for (var i = 0;i<arr.length;i++){
        sum += arr[i];
         
    }
    console.log(sum)
}
add(arr)

//     for (var i = 0; i<arr.length;i++){
//          sum += arr[i]
//     }
//     console.log(sum)


//     var sum1 = 0
//  for (var i = 0; i<arr1.length;i++){
//     sum1 -= arr1[i]
//  }
//  console.log(sum1)

